load-tests/artillery.yml
# Artillery Load Testing Configuration
# https://www.artillery.io/docs

config:
  target: "{{ $processEnvironment.TARGET_URL || 'http://localhost:3000' }}"
  phases:
    # Warm-up phase: Gradually ramp up to 10 users over 1 minute
    - duration: 60
      arrivalRate: 1
      rampTo: 10
      name: "Warm-up phase"
    
    # Sustained load: 25 concurrent users for 3 minutes
    - duration: 180
      arrivalRate: 25
      name: "Sustained load"
    
    # Peak load: Ramp up to 50 users for 2 minutes
    - duration: 120
      arrivalRate: 25
      rampTo: 50
      name: "Peak load"
    
    # Cool-down: Drop back to 10 users for 1 minute
    - duration: 60
      arrivalRate: 50
      rampTo: 10
      name: "Cool-down"

  # Performance thresholds
  ensure:
    # 95% of requests complete within 2 seconds
    p95: 2000
    # 99% of requests complete within 5 seconds
    p99: 5000
    # Maximum error rate of 1%
    maxErrorRate: 1

  # Plugin configuration
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # Request defaults
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
      Accept: "application/json"

  # Payload data for tests
  payload:
    path: "test-data.csv"
    fields:
      - "email"
      - "password"
      - "propertyName"
    skipHeader: true
    order: "sequence"
    delimiter: ","

scenarios:
  # Scenario 1: Homepage and public pages
  - name: "Browse public pages"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: text/html
      
      - think: 2
      
      - get:
          url: "/api/monitoring/health"
          expect:
            - statusCode: 200
            - hasProperty: status

  # Scenario 2: User authentication flow
  - name: "User login and dashboard"
    weight: 40
    flow:
      # Visit login page
      - get:
          url: "/auth/login"
          expect:
            - statusCode: 200
      
      - think: 3
      
      # Attempt login (will fail without actual credentials, but tests the endpoint)
      - post:
          url: "/api/auth/callback/credentials"
          json:
            email: "test@example.com"
            password: "testpassword123"
          capture:
            - json: "$.error"
              as: "loginError"
          expect:
            - statusCode: [200, 401]
      
      - think: 2

  # Scenario 3: Property listing and details
  - name: "Browse properties"
    weight: 20
    flow:
      # Get properties list
      - get:
          url: "/api/properties"
          expect:
            - statusCode: [200, 401]
          capture:
            - json: "$.data[0].id"
              as: "propertyId"
      
      - think: 2
      
      # Get specific property (if available)
      - get:
          url: "/api/properties/{{ propertyId }}"
          ifTrue: "propertyId"
          expect:
            - statusCode: [200, 401, 404]

  # Scenario 4: API metrics endpoint (monitoring)
  - name: "Check monitoring endpoints"
    weight: 5
    flow:
      - get:
          url: "/api/monitoring/metrics"
          expect:
            - statusCode: 200
            - contentType: json
      
      - think: 1
      
      - get:
          url: "/api/monitoring/health"
          expect:
            - statusCode: [200, 503]
            - hasProperty: status

  # Scenario 5: Search and filter operations
  - name: "Search properties"
    weight: 5
    flow:
      - get:
          url: "/api/properties?search=apartment&page=1&limit=20"
          expect:
            - statusCode: [200, 401]
      
      - think: 2
      
      - get:
          url: "/api/properties?status=active&sort=createdAt"
          expect:
            - statusCode: [200, 401]